01  WS-AREA-1 PIC X(100). 
01  WS-AREA-2 PIC X(100).

PROCEDURE DIVISION.
     MOVE 12345 TO WS-AREA-1(1:5)
     DISPLAY WS-AREA-1
     MOVE "SomeData" TO WS-AREA-2
     DISPLAY WS-AREA-2
     STOP RUN.